app/Helpers/myhelper_helper.php

    function auditlog($action_made)
    {
        $AuditlogModel = new AuditlogModel();
        $data = [
            'name' => session('name'),
            'action_made'  => $action_made

        ];
        $AuditlogModel->save($data);
---
INSERT INTO "auditlogs" ("name", "action_made") VALUES ('Admin sobbbbbbnn', 'List User')