app/Controllers/Login.php

SELECT *
FROM "users"
WHERE "email" = 'test@gmail.com'
 LIMIT 1
---
    public function loginAuth()
    {
        $session = session();
        $userModel = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $userModel->where('email', $email)->first();