app/Controllers/Report.php

SELECT *
FROM "users"
---
    public function index()
    {
        $cache = \Config\Services::cache();

        $data['users'] = $cache->remember('cached_data', 3600, function () {
            $db = \Config\Database::connect();
            $query = $db->table('users')->get()->getResult();