app/Controllers/User.php

SELECT *
FROM "users"
 LIMIT 5
SELECT COUNT(*) AS "numrows"
FROM "users"
---


      if ($search == '') {
          $paginateData = $this->UserModel->paginate(5);

SELECT *
FROM "auditlogs"
---
    public function datatable()
    {
        auditlog('Datatable');


      $data = [
          'auditlogs' => $this->AuditlogModel->findAll()
      ];

SELECT *
FROM "users"
WHERE "id" = '2'
 LIMIT 1
---
    public function edit($id)
    {
        $data['act'] ='edit';
        $data['user'] = $this->UserModel->where('id', $id)->first();

UPDATE "users" SET "name" = 'norizi', "email" = 'norizi@gmail.com'
WHERE "users"."id" IN ('2')
---
    public function update()
    {



        $rules = [
            'name' => 'required|min_length[3]',
            'email' => 'required|valid_email',
        ];

        $id = $this->request->getVar('id');

        if($this->validate($rules)){

           //$formModel = new FormModel();
            $data = [
                'name' => $this->request->getVar('name'),
                'email'  => $this->request->getVar('email'),
            ];
            $this->UserModel->update($id, $data);